
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЗаполнитьПараметрыФормы();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ДанныеПроизвольногоЗапроса(Команда)
	
	Если НЕ ПроверитьЗаполнение() Тогда
		Возврат;	
	КонецЕсли; 
	
	СтруктураПараметров = Параметры.СтруктураПараметров;
	ДанныхОбмена = РезультатПолученияДанныхПроизвольногоЗапроса(СтруктураПараметров);
	Если ИнтерактивныйВызов = Ложь Тогда
		Закрыть(ДанныхОбмена);
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьПроизвольныйЗапрос(Команда)
	ОбработатьПроизвольныйЗапросНаСервере(Параметры.СтруктураПараметров);
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьПроизвольныйОтвет(Команда)
	ОбработатьПроизвольныйОтветНаСервере(Параметры.СтруктураПараметров);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы_ИмяТаблицы

#КонецОбласти

#Область ОбработчикиКомандФормы

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьПараметрыФормы()
	
	Если Параметры.СтруктураПараметров = Неопределено  Тогда
		ИнтерактивныйВызов = Истина;
	Иначе 
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, Параметры.СтруктураПараметров, Параметры.СтруктураПараметров.СписокСвойств); 
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Функция ЗаполнитьКаталогХраненияФайловОбмена(ИмяБазыПриемника, ИмяЗапроса) Экспорт
	
	КаталогОбменаПЗ = "";
	Если ЗначениеЗаполнено(ИмяБазыПриемника) И ЗначениеЗаполнено(ИмяЗапроса)  Тогда
		НастройкиТекущейБД = оду_ОбщийПовтИсп.НастройкиТекущейБД();
		КаталогОбменаПЗ = оду_Общий.КаталогФайлаОбмена(НастройкиТекущейБД, ИмяБазыПриемника);
		Если ЗначениеЗаполнено(КаталогОбменаПЗ)  Тогда
			КаталогОбменаПЗ = СтрШаблон("%1\%2\%3", КаталогОбменаПЗ, "arbitraryRequests", ИмяЗапроса);
		КонецЕсли; 
	КонецЕсли;
	
	Возврат КаталогОбменаПЗ;
	
КонецФункции



&НаСервере
Функция РезультатПолученияДанныхПроизвольногоЗапроса(СтруктураПараметров)
	
	Обр = РеквизитФормыВЗначение("Объект");
	ДанныхОбмена = Обр.РезультатПолученияДанныхПроизвольногоЗапроса(СтруктураПараметров);
	Если ИнтерактивныйВызов = Истина Тогда
		
		Если НЕ ЗначениеЗаполнено(ИмяФайлаОбмена)  Тогда
			Если НЕ ЗначениеЗаполнено(КаталогОбмена) Тогда
				ИмяБазыПриемника = пр_Общий.ЗначениеРеквизитаПоСсылке(УчастникОбмена, "Код");
				КаталогОбмена = ЗаполнитьКаталогХраненияФайловОбмена(ИмяБазыПриемника, ИмяЗапроса);
			КонецЕсли; 
			
			ИмяФайла = Формат(ТекущаяДатаСеанса(), "ДФ='yyyy MM dd'"); 
			ИмяФайлаОбмена = пр_Общий.ПолныйПутьКФайлу(, ИмяФайла, КаталогОбмена, , Истина);
			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ИмяФайлаОбмена)  Тогда
			//ТелоЗапроса = оду_Общий.СформироватьJSON_Сериализ(ДанныхОбмена, ИмяФайлаОбмена);	
			ТелоЗапроса = Обр.СформироватьJSON_Сериализ(ДанныхОбмена, ИмяФайлаОбмена);	
		КонецЕсли;
		
	КонецЕсли; 
	Возврат ДанныхОбмена;
КонецФункции

&НаСервере
Процедура ОбработатьПроизвольныйЗапросНаСервере(СтруктураПараметров)
	
	Если ЗначениеЗаполнено(ИмяФайлаОбмена)  Тогда
		Обр = РеквизитФормыВЗначение("Объект");
		ДанныеОтвета = Обр.ОбработатьПроизвольныйЗапрос(ИмяФайлаОбмена);
		
		Если ИнтерактивныйВызов = Истина Тогда
			
			//Если НЕ ЗначениеЗаполнено(ИмяФайлаОбмена)  Тогда
				Если НЕ ЗначениеЗаполнено(КаталогОбмена) Тогда
					ИмяБазыПриемника = пр_Общий.ЗначениеРеквизитаПоСсылке(УчастникОбмена, "Код");
					КаталогОбмена = ЗаполнитьКаталогХраненияФайловОбмена(ИмяБазыПриемника, ИмяЗапроса);
				КонецЕсли; 
				
				ИмяФайла = Формат(ТекущаяДатаСеанса(), "ДФ='yyyy MM dd'") + " Ответ"; 
				ИмяФайлаОбмена = пр_Общий.ПолныйПутьКФайлу(, ИмяФайла, КаталогОбмена, , Истина);
				
			//КонецЕсли;
			
			Если ЗначениеЗаполнено(ИмяФайлаОбмена)  Тогда
				//ТелоЗапроса = оду_Общий.СформироватьJSON_Сериализ(ДанныеОтвета, ИмяФайлаОбмена);
				ТелоЗапроса = Обр.СформироватьJSON_Сериализ(ДанныеОтвета, ИмяФайлаОбмена);
			КонецЕсли;
			
		КонецЕсли; 
		
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьПроизвольныйОтветНаСервере(СтруктураПараметров)
	Обр = РеквизитФормыВЗначение("Объект");
	Обр.ОбработатьПроизвольныйОтвет(СтруктураПараметров);
КонецПроцедуры

&НаКлиенте
Процедура КаталогОбменаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	пр_Клиент.УстановкаКаталогаФайлаНачалоВыбора(ЭтотОбъект, "КаталогОбмена", Ложь);	
КонецПроцедуры

&НаКлиенте
Процедура ИмяФайлаОбменаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	Если ЗначениеЗаполнено(КаталогОбмена)  Тогда
		//пр_Клиент.УстановкаКаталогаФайлаНачалоВыбора(ЭтотОбъект, "ИмяФайлаОбмена",, КаталогОбмена);
		УстановкаКаталогаФайлаНачалоВыбора(ЭтотОбъект, "ИмяФайлаОбмена",, КаталогОбмена);
	Иначе	
		пр_Клиент.УстановкаКаталогаФайлаНачалоВыбора(ЭтотОбъект, "ИмяФайлаОбмена");
		НачПоз = СтрНайти(ИмяФайлаОбмена,"\",НаправлениеПоиска.СКонца) - 1;
		КаталогОбмена = Лев(ИмяФайлаОбмена, НачПоз);
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура УстановкаКаталогаФайлаНачалоВыбора(Форма, ИмяРеквизита, ВыборФайла = Истина, КаталогПоУмолчанию = "", МножественныйВыбор = Ложь)	Экспорт
	пр_Клиент.РезультатУстановкиКаталогаФайлаНачалоВыбора(Форма, ИмяРеквизита, ВыборФайла, КаталогПоУмолчанию, МножественныйВыбор);	
КонецПроцедуры 

//&НаКлиенте
//Процедура УстановкаКаталогаФайлаНачалоВыбора(Форма, ИмяРеквизита, ВыборФайла = Истина, КаталогПоУмолчанию = "", МножественныйВыбор = Ложь)	Экспорт
//	
//	Каталог = пр_Клиент.ВыборКаталогаФайлаНачалоВыбора(ВыборФайла, КаталогПоУмолчанию, МножественныйВыбор);
//	Если ЗначениеЗаполнено(Каталог)  Тогда
//		Форма[ИмяРеквизита] = Каталог; 
//	КонецЕсли; 

//КонецПроцедуры 

#КонецОбласти

#Область СлужебныеПроцедурыИФункцииБСП

#КонецОбласти

